app/Http/Controllers/CartController.php

    public function save(Request $request)
    {
        $request->validate([
            'product_variation_id'=>'required'
        ]);
        $cart = \App\Models\Cart::firstorcreate([
            'session_id' => session()->getId()
        ]);

        $cart->photoVariations()->syncWithoutDetaching($request->product_variation_id);
---
delete from `cart_photo` where `cart_id` = 1 and `photo_variation_id` in (1)
insert into `cart_photo` (`cart_id`, `photo_variation_id`) values (2, 4)

    public function destroy(Request $request)
    {
        $cart = \App\Models\Cart::where('session_id',session()->getId())->first();

        $cart->photoVariations()->detach($request->id);
---
select * from `carts` where `session_id` = 'xHxjY7zRKGYMxJL8gTkqtZZadXnoOkxkLG1HW2s7' limit 1
delete from `cart_photo` where `cart_id` = 2 and `photo_variation_id` in ('1')