app/Http/Controllers/HomeController.php

select * from `photos`
---
    public function index()
    {
        $photos = \App\Models\photo::all();

        return view('site.pages.home')->with(['photos' => $photos ]);