app/Http/Controllers/PhotoController.php

select * from `photos` where `idx` = 'abc123' limit 1
---
    public function show(Request $request)
    {
        $photo = \App\Models\photo::where('idx',$request->id)->first();
        if($photo == null){
            return abort(404);
        }
        return view('site.pages.show-photo')->with(['photo'=>$photo]);