app/Providers/AppServiceProvider.php

    public function boot()
    {
        View::composer('*',function ($view) {
        $view->with('cart',\App\Models\Cart::where('session_id',session()->getId())->first());
---
select * from `carts` where `session_id` = 'xHxjY7zRKGYMxJL8gTkqtZZadXnoOkxkLG1HW2s7' limit 1